

if __name__ == "__main__":
    #print('Zdorov')

    #Завдання 1
    #Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    #Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом: якщо число кратне 7,
    #його треба виводити на екран.

    #Дані від користувача:
    # number_one = int(input("Введіть число початок діапазону:"))
    # number_two = int(input("Введіть число кінець діапазону:"))

    #Розв'язок задачі:
    # for item in range(number_one,number_two + 1):
    #     if item % 7 ==0:
    #         print(item)

    #Завдання 2
    #Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    #Необхідно проаналізувати всі числа в цьому діапазоні. Потрібно вивести на екран:

    #1)Всі числа діапазону.
    #2)Всі числа діапазону в спадному порядку.
    #3)Всі числа, кратні 7.
    #4)Кількість чисел, кратних 5.

    # Дані від користувача:
    # number_one = int(input("Введіть число початок діапазону:"))
    # number_two = int(input("Введіть число кінець діапазону:"))

    # Розв'язок задачі:
    #1)
    # for item in range(number_one, number_two + 1):
    #     print(item)
#!!!!!!!!!!!2)Ігор я виконав завдання,але воно друкує мені зворотні списки при кожному новому числі.
    #А як зробити щоб друкувало тільки останній список??
    # list_of_numbers = []
    # for item in range(number_one, number_two + 1):
    #     list_of_numbers.append(item)
    #     reversed_list = list(reversed(list_of_numbers))
    #     print(reversed_list)

    #3)
    # for item in range(number_one, number_two + 1):
    #     if item % 7 == 0:
    #         print(item)

#!!!!!!!!!4)Та сама історія.Задача розв'язана,але перераховує кожне число,а мені потрібен тільки останній результат
    # list_of_numbers = []
    # for item in range(number_one, number_two + 1):
    #      if item % 5 == 0:
    #          list_of_numbers.append(item)
    #          print(len(list_of_numbers))

    #Завдання 3
    # Користувач вводить із клавіатури два числа (початок і кінець діапазону).
    # Потрібно проаналізувати всі числа в цьому діапазоні.
    # Виведення на екран має відбуватися за правилами, зазначеними нижче.
    # Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово "Fizz".
    # Якщо число кратне 5, потрібно вивести слово "Buzz".
    # Якщо число кратне 3 і 5, потрібно вивести "Fizz Buzz".
    # Якщо число не кратне ні 3, ні 5, потрібно вивести саме число.

    # Дані від користувача:
    # number_one = int(input("Введіть число початок діапазону:"))
    # number_two = int(input("Введіть число кінець діапазону:"))

    # Розв'язок задачі:
    # for item in range(number_one, number_two + 1):
    #     if item % 3 == 0 and item % 5 != 0 :
    #         print("Fizz")
    #     elif item % 5 == 0 and item % 3 != 0:
    #         print("Buzz")
    #     elif item % 3 == 0 and item % 5 == 0:
    #         print("Fizz Buzz")
    #     elif item % 3 != 0 and item % 5 != 0:
    #         print(item)